davidday99/tm4c-hal/src/main.c
#include "system.h"
#include "ssi.h"
#include "gpio.h"
#include "tm4c123gh6pm.h"
#include "st7735.h"
#include "enc28j60.h"
#include "enc.h"
#include "lcd.h"
#include "ip_util.h"
#include "stdlib.h"
#include "event_queue.h"
#include <string.h>

extern void EnableInterrupts();
extern void DisableInterrupts();
extern void StartCritical();
extern void EndCritical();

void Delay1s(void){
    unsigned long volatile time = 2400000;
    while(time){
        time--;
    }
}

uint8_t transmit[16] = {
    0xAB,
    0xCD,
    0xEF,
    0x01,
    0x02,
    0x03,
    0xC0,
    0x0C,
    0xC0,
    0x0C,
    0xC0,
    0x0C,
    0x00,
    0x08,
    0xFF,
    0xFF
};

// uint32_t strlen(const char *s) {
//     uint32_t len = 0;
//     while (*s++)
//         len++;
//     return len;
// }

LCD lcd;

int main(void){
    uint8_t delay = 0;

    DisableInterrupts();

    PLL_init();

    ENC enc;
    lcd_init(&lcd);
    
    uint8_t x[] = {0,0,0};
    uint8_t y[] = {1,2,3};

    memcpy(x, y, 3);
    
    if (enc_init(&enc)) {
        lcd_write(&lcd, "ENC initialized.\n");
        lcd_write(&lcd, "Enabling receive.\n");
        ENC28J60_enable_receive(&ENC28J60) ? lcd_write(&lcd, "Receive enabled.\n") : 
                                    lcd_write(&lcd, "Could not enable.\n");
    } else {
        lcd_write(&lcd, "Could not init.\n");
    }

    EnableInterrupts();
    event_t e;

    while (1) {
        // send_arp_request(&lcd, &enc);
        Delay1s();
        while  ((e = event_queue_pop()) != EVENT_QUEUE_EMPTY)
            event_queue_handle_event(e, &lcd, &enc);
    }
}